{
  "translation": {
    "Welcome to React": "Being a creative person, I easily find effective ways to solve problems entailing products’ infrastructure",
    "AlfonsinoJob": "In collaboration with my assistant and with the back-end team, my work consisted in re-writing the application of the food delivery start-up into React-Native, having less performant frameworks. I created some android native java code to solve specific problems and enriched my knowledge in Redux and git.",
    "Giu": "Jun",
    "tendit": "Together with other two associates, I launched my own job-demanding start-up. I created the app infrastructure, entailing a back-end written in NodeJs and a front-end in React-Native. The whole hosted on a docker container on digitalOcean.",
    "purpleSquid": "Being part of the development of a restaurant ordering app, as Software Engineer for Purple Squid Software; I improved teamwork skills, adjusting to weekly deadlines under an agile methodology organized in sprints.",
    "Vuxe": "Working for Vuxe Ltd as a full-stack developer, I improved the job demanding platform. The tasks included migrating the react-native application from REST api to GRAPHQL and to write integration tests. I created a signup form for businesses; hosted on a web app including google location api.",
    "heriot": "As a thesis project, I developed an events app for students living in Heriot-Watt Campus, in order to improve their social life and facilitating the participation to events. I gathered the app requirements through a student sur vey and a focused interview with the events organization managers. During this project I selected and discovered the best technologies to use in developing a mobile app.",
    "annual": "Worked for a period of 3 months in a call center in Heriot-watt university to ask funds to the alumni. Developing interpersonal skills and teamwork.",
    "activity": "I have been an activity leader for EF international school assisting young students into their travels abroad. Taking responsabilities such as on field trips managing large groups of international students.",
    "Udemy": "Udemy Courses on Dev-ops, React and React-Native, socket-io and redis. As well as web security and nodejs",
    "Degree": "Awarded a Bachelor of Science in Computer Science with honor of the first class. During the four years I learnt the fundamentals of computer science. Primarily using java as the programming languages I was continuously challenged with real-word-like problems in our courseworks.",
    "ef": "Training course to enable and prepare students to the British superior education system.",
    "Vinci": "During this period I won four competition in which I traveled abroad to study English. One month each time",
    "alfPartnerP": "Written, tested and distributed a mobile app targeting android tablet devices to 800+ users.",
    "alfPartnerB": "During my job at Alfonsino srl I developed the app utilised by Alfonsino’s restaurants partner. The app includes complex flows and requirements like ringing tablet on loop on new order arrives, working on old android devices (kitkat) and many others. This experience allowed me to approach android native development and native modules integration in react-native. \n The app includes three main sections: order awaiting, order to prepare and profile. Order paid by the customers appear in the tab named `in attesa` triggering an in app notification or background notification with custom sound. Same for orders which are to be prepared in `da preparare`",
    "alfPartnerPreview": "The app includes three main sections: order awaiting, order to prepare and profile. Order paid by the customers appear in the tab named `in attesa` triggering an in app notification or background notification with custom sound. Same for orders which are to be prepared in `da preparare`",
    "tenditP": "Designed the user interface, developed the front end and back end of a mobile app running on web/ android and iOS.",
    "tenditB": "Tendit is a fully functional app which is built to scale, as being the basis of its start-up idea. Many hours have been spent on this project, making it the most important. The app is a platform intended to connect people looking for a service with the service offerers",
    "tenditPreview1": "This shows the login and the main functionality of the app, which is to apply for services requested by other users",
    "tenditPreview2": "This shows the process of inserting a new request for a specific service",
    "tenditPreview3": "This shows the profile of a user, which can be a service offerer or a service seeker or both.",
    "inventarioP": "Developed and distributed a utility mobile app for a single user. The app facilitates the user’s daily work by registering and managing their products.",
    "inventarioB": "Inventario is an app ad-hoc for one of my clients. The app is only installed and used by him to facilitate his daily job workflow, which consists in updating and managing different vending machines in different locations.",
    "valore24P": "Collaborated with a back-end developer to integrate a new feature in Valore-24, a popular tool used by Italian companies and distributed by Il sole 24 ore.",
    "valore24B": "Created the front end of a section of the app offered by il sole 24 ore: Valore24. In collaboration with a back-end developer, we created a new session in the web-application, the risk assessment. Additionally we migrated the app to a different back-end, integrating a new api.",
    "diverseP": "Created, deployed and distributed an agency website",
    "diverseB": "Created a website for a software development agency. With the help of a designer who created its brand identity, I made the website performant and easily extendable, creating a custom Django theme.",
    "blogappP": "Created a showcase blogging app including back-end and front-end development. The app includes also real-time updates between its features.",
    "blogappB": "Full stack mobile and web application made with graphql back-end/ apollo and react-native with expo as front end. The app runs on any device (web-android-ios) as it is using react-native-web. The app uses real time updates and other really cool features, Clone its repo to have a go :).",
    "diversecommerceP": "Created a showcase E-commerce progressive web app.",
    "diversecommerceB": "Created a fully working showcase e-commerce website using react and node js to serve the app. The app uses Stripe integration to handle payments and it is hosted for on heroku.",
    "netflixP": "Created a showcase clone of popular entertainment site Netflix.",
    "netflixB": "This is a Netflix clone realised to showcase an entertainment app in react. The login/sign up flow was implemented using firebase auth and the collection of films and series are stored on firestore."
  }
}
